# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv5 object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/yolov5

# Parameters
nc: 12  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],   # 1-P2/4
   [-1, 3, C3Ghost, [128]],      # 2
   [-1, 1, DWConv, [128, 1, 1]], # 3
   [-1, 1, Conv, [256, 3, 2]],   # 4-P3/8
   [-1, 6, C3Ghost, [256]],      # 5
   [-1, 1, Conv, [512, 3, 2]],   # 6-P4/16
   [-1, 9, C3Ghost, [512]],      # 7
   [-1, 1, Conv, [1024, 3, 2]],  # 8-P5/32
   [-1, 3, C3Ghost, [1024]],     # 9
   [-1, 1, SPPF, [1024, 5]],     # 10
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],   # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 12
   [[-1, 7], 1, Concat, [1]],       # 13 cat backbone P4
   [-1, 3, C3, [512, False]],       # 14
   [-1, 1, TransformerBlock, [512, 1, 1]],  # 15


   [-1, 1, Conv, [256, 1, 1]],      # 16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 17
   [[-1, 5], 1, Concat, [1]],  # 18   cat backbone P3
   [-1, 3, C3, [256, False]],  # 19 (P3/8-small)
   [-1, 1, TransformerBlock, [256, 1, 1]],  # 20

   [-1, 1, Conv, [256, 3, 2]],   # 21
   [[-1, 16], 1, Concat, [1]],  #  22 cat head P4
   [-1, 3, C3, [512, False]],  # 23 (P4/16-medium)
   [-1, 1, TransformerBlock, [512, 1, 2]], # 24

   [-1, 1, Conv, [512, 3, 2]],  # 25
   [[-1, 11], 1, Concat, [1]],  # 26 cat head P5
   [-1, 3, C3, [1024, False]],  # 27 (P5/32-large)
   [-1, 1, TransformerBlock, [1024, 1, 2]], # 28

   [[20, 24, 28], 1, Detect_yolov5, [nc]],  # Detect(P3, P4, P5)
  ]
